"""
Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. Она растет на круглой грядке, причем кусты высажены только по окружности. 
Таким образом, у каждого куста есть ровно два соседних. Всего на грядке растет N кустов.
Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них выросло различное число ягод – на i-ом кусте выросло ai ягод.
В этом фермерском хозяйстве внедрена система автоматического сбора черники. Эта система состоит из управляющего модуля и нескольких собирающих модулей. 
Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом, собирает ягоды с этого куста и с двух соседних с ним.
Напишите программу для нахождения максимального числа ягод, которое может собрать за один заход собирающий модуль, 
находясь перед некоторым кустом заданной во входном файле грядки.
4 -> 1 2 3 4
9
"""

import random
N = int(input('Введите N - число элементов в массиве: '))
max = 10
A = []
for i in range(N):
    A.append(random.randint(0, max))


print(A)
list_sum = []

for i in range(N):
    list_sum.append(A[i]+A[i-1]+A[i-2])

print(list_sum)
list_sum.sort()
print(list_sum[-1])